tap "caskroom/cask"

# Install docker dependencies
brew "docker"
brew "docker-machine"
cask "virtualbox"

# Use better apps for browsing, listening to music, and communicating
cask "google-chrome"
cask "hyper"
cask "notion"
cask "sketch"
cask "slack"
cask "spotify"
cask "vlc"

# Utilities
cask "alfred"
cask "apptrap"
cask "caffeine"
cask "google-photos-backup"
cask "imageoptim"
cask "licecap"
cask "marked"
cask "pixelstick"
cask "skitch"

# Install dev environment requirements
brew "fish"
brew "hub"
brew "neovim"
brew "python3"
brew "the_silver_searcher"
brew "tmux"
tap "neovim/neovim"
